In [1]:
import numpy as np
from pandas import Series, DataFrame

import pandas as pd

In [3]:
ser1 = Series(np.arange(3), index=['a','b','c'])
ser1

a    0
b    1
c    2
dtype: int32

In [4]:
#melakukan drop untuk series
ser1.drop('b')

a    0
c    2
dtype: int32

In [12]:
#tapi tidak kesimpan di ser1
#yang harus dilakukan ser1 = ser1.drop()
ser1

a    0
b    1
c    2
dtype: int32

In [13]:
dframe1 = DataFrame(np.arange(9).reshape(3,3), index=['SF','LA','NY'], columns=['pop','size','year'])
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [15]:
dframe2 = dframe1.drop('LA')
dframe2

    pop  size  year
SF    0     1     2
NY    6     7     8

In [18]:
#drop kolom dari DataFrame
#untuk melakukan drop kolom, perlu didefinisikan axis mana yang menjadi target
#secara default, axis untuk drop adalah 0, yang mana axis 0 adalah baris sementara axis 1 adalah kolom
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

## Selecting Entries

In [28]:
ser1 = Series(np.arange(3), index=['A','B','C'])
ser1

A    0
B    1
C    2
dtype: int32

In [29]:
#selain dikali, Series juga bisa dibagi.
#kemungkinan besar juga bisa dilakukan modulo? Let's try
ser1 = 2*ser1
ser1

#bisa
#ser2 = ser1%2
#ser2

A    0
B    2
C    4
dtype: int32

In [32]:
#memanggil index menggunakan label
ser1['B']

2

In [33]:
#memanggil index menggunakan integer, integer yang menggambarkan index tsb
ser1[1]

2

In [35]:
ser1[0:3]

A    0
B    2
C    4
dtype: int32

In [36]:
ser1[::-1]

C    4
B    2
A    0
dtype: int32

In [40]:
#memanggil index menggunakan label dengan lebih dari satu
ser1[['A','B']]

#ser1[['A','B']] bagaimana caranya memanggil series tapi dengan urutan terbalik?

A    0
B    2
dtype: int32

In [44]:
#tidak harus berurutan, index A dan C juga bisa
ser1[['A','C']]

#mengambil spesifik index dan urutan terbalik, untuk sementara dapat dilakukan dengan cara ribet
#ser1[['A','C']].reindex(index=ser1.index[::-1]).drop('B')

A    0
C    4
dtype: int32

In [47]:
#series juga bisa melakukan .head() dan .tail()
#ser1.tail(2)

B    2
C    4
dtype: int32

In [48]:
#bisa melakukan logic
ser1[ser1>3]

C    4
dtype: int32

In [49]:
#bisa dimodifikasikan juga
ser1[ser1>3] = 10
ser1

A     0
B     2
C    10
dtype: int32

In [51]:
dframe = DataFrame(np.arange(25).reshape(5,5), index=['NYC', 'LA', 'SF', 'DC', 'Chi'], 
                  columns=['A','B','C','D','E'])
dframe

      A   B   C   D   E
NYC   0   1   2   3   4
LA    5   6   7   8   9
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [52]:
#select menggunakan nama kolom
dframe['B']

NYC     1
LA      6
SF     11
DC     16
Chi    21
Name: B, dtype: int32

In [55]:
#select menggunakan row, secara konvensional tidak bisa which is obvious sebenarnya 
dframe[2]

KeyError: 2

In [56]:
#DOKUMENTASI LENGKAP TERKAIT SELECTING: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html

In [61]:
#dframe .loc[] parameter pertama merupakan index, sedangkan parameter kedua merupakan kolom
#bisa lebih dari satu dengan menggunakan kurung siku
dframe.loc[['NYC','LA'],['A','B']]

     A  B
NYC  0  1
LA   5  6

In [ ]:
dframe.loc

In [65]:
dframe[['B','E']]

      B   E
NYC   1   4
LA    6   9
SF   11  14
DC   16  19
Chi  21  24

In [64]:
#cara tanpa .loc tidak bisa
dframe[['NYC','SF'],['B','E']]

TypeError: '(['NYC', 'SF'], ['B', 'E'])' is an invalid key

In [67]:
#baris juga bisa dimasukkan logic
#mengembalikan DataFrame yang value dari kolom C lebih besar dari i8
dframe[dframe['C'] > 8]

      A   B   C   D   E
SF   10  11  12  13  14
DC   15  16  17  18  19
Chi  20  21  22  23  24

In [68]:
#mengembalikan DataFrame boolean, yang mana melihat setiap value, apakah value tsb lebih besar dari 10
dframe > 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF   False   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [71]:
#bisa juga menggunakan == (tentu saja!) untuk melihat value mana yang sama dengan 10
dframe == 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF    True  False  False  False  False
DC   False  False  False  False  False
Chi  False  False  False  False  False

In [72]:
#lebih besar sama dengan juga bisa
dframe >= 10

         A      B      C      D      E
NYC  False  False  False  False  False
LA   False  False  False  False  False
SF    True   True   True   True   True
DC    True   True   True   True   True
Chi   True   True   True   True   True

In [73]:
#dilakukan perkalian juga bisa, pasti operator lain juga bisa seharusnya
dframe * 2

      A   B   C   D   E
NYC   0   2   4   6   8
LA   10  12  14  16  18
SF   20  22  24  26  28
DC   30  32  34  36  38
Chi  40  42  44  46  48